constellations = ("ชวด", "ฉลู", "ขาล", "เถาะ", "มะโรง", "มะเส็ง", "มะเมีย", "มะแม", "วอก", "ระกา", "จอ", "กุน")
symbol = ("หนู", "วัว", "เสือ", "กระต่าย", "งูใหญ่", "งูเล็ก", "ม้า", "แพะ", "ลิง", "ไก่", "หมา", "หมู")

for year in range(2565, 2570+1):
    print(f"ปี {year} ตรงกับ {constellations[(year + 5)%12]} >> สัญลักษณ์ {symbol[(year + 5)%12]}")

#OUTPUT
"""
ปี 2565 ตรงกับ ขาล >> สัญลักษณ์ เสือ
ปี 2566 ตรงกับ เถาะ >> สัญลักษณ์ กระต่าย
ปี 2567 ตรงกับ มะโรง >> สัญลักษณ์ งูใหญ่
ปี 2568 ตรงกับ มะเส็ง >> สัญลักษณ์ งูเล็ก
ปี 2569 ตรงกับ มะเมีย >> สัญลักษณ์ ม้า
ปี 2570 ตรงกับ มะแม >> สัญลักษณ์ แพะ
"""